Repository: FriendsOfTYPO3/frontend_editing
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: ca, es, fr, it, no, sv

# top-bar.save-all
source: Save All
ca: Guardar tot
es: Guardar Todo
fr: Tout enregistrer
it: Salva modifiche
no: Lagre alt
sv: Spara alla

# top-bar.discard-all
source: Discard
ca: Descartar
es: Descartar
fr: Annuler
it: Scarta modifiche
no: Forkast
sv: Kasta

# top-bar.full-view
source: Full view
fr: Vue complète
sv: Fullständig vy

# right-bar.tools-properties
source: Tools & Properties
fr: Outils & propriétés
sv: Verktyg & egenskaper

# right-bar.page-edit
source: Edit page properties
fr: Éditer les propriétés de la page
sv: Ändra sidans inställningar

# right-bar.page-new
source: Create new Page
fr: Créer une nouvelle page
sv: Skapa ny sida

# notifications.save-title
source: Content saved
ca: Contingut guardat
es: Contenido guardado
fr: Contenu enregistré
it: Contenuto salvato
no: Innhold lagret
sv: Innehåll sparat

# notifications.save-description
source: Saved the content with identifier:
ca: Contingut guardat amb identificador:
es: Guardado el contenido con identificador:
fr: Contenu enregistré avec l'identifiant:
it: Salvato il contenuto con identificatore:
no: Lagret innhold med identifikator:
sv: Sparade innehållet med identifierare:

# notifications.save-went-wrong
source: Something went wrong
ca: Alguna cosa no ha anat bé
es: Algo ha salido mal
fr: Une erreur s'est produite
it: Si è verificato un errore
no: Noe gikk galt
sv: Något gick fel

# notifications.no-changes-title
source: No changes made
ca: No s'ha fet cap canvi
es: No se ha realizado ningún cambio
fr: Aucun changement n'a été apporté
it: Nessuna modifica fatta
no: Ingen endringer er gjort
sv: Inga ändringar har gjorts

# notifications.no-changes-description
source: There are currently no changes made to the content on the page!
ca: No hi ha cap canvi al contingut de la pàgina!
es: Actualmente no hay cambios realizados en el contenido de la página!
fr: Il n'y a pour l'instant rien de modifié au contenu de cette page!
it: Al momento non ci sono modifiche apportate al contenuto nella pagina!
no: Det er for øyeblikket ingen endringer i innholdet på siden!
sv: Det finns för närvarande inga ändringar i innehållet på sidan!

# notifications.remove-all-changes
source: Are you sure you want to remove all unsaved changes?
ca: Està segur que vols eliminar tots els canvis no guardats?
es: ¿Está seguro que desea eliminar todos los cambios no guardados?
fr: Les modifications non enregistrées seront perdues. Continuer?
it: Vuoi veramente scartare tutte le modifiche non salvate?
no: Er du sikker på at du vil forkaste alle endringer som ikke er lagret?
sv: Är du säker på att du vill kasta osparade ändringar?

# notifications.unsaved-changes
source: You have some unsaved changes. They will disappear if you navigate away!
fr: Vous avez des modifications non-enregistrées. Elles seront perdues si vous quitter cette page!
sv: Du har några osparade ändringar. De kommer att försvinna om du navigerar bort!

# notifications.delete-content-element
source: Are you sure you want to delete the content element?
ca: Estàs segur que vols eliminar aquest element de contingut?
es: ¿Está seguro de que desea eliminar el elemento de contenido?
fr: Êtes-vous sûr(e) de vouloir supprimer cet élément de contenu?
it: Sei sicuro di che voler eliminare questo elemento?
no: Er du sikker på at du vil slette dette innholdselementet?
sv: Är du säker du vill ta bort detta element?

# notifications.add-content-element
source: You would have the option to add an element now, if this feature was implemented.
ca: Tindria l'opció d'afegir un element ara, si s'implementés aquesta funció.
es: Tendría la opción de añadir un elemento ahora, si se implementara esta función.
fr: Vous pourriez avoir la possibilité d'ajouter un élément dès maintenant, si cette fonctionnalité était activée.
it: Avresti la possibilità di aggiungere un elemento ora, se questa funzione fosse stata implementata.
no: Du ville hatt muligheten til å legge til et element nå, hvis denne funksjonen var implementert.
sv: Du skulle ha möjlighet att lägga till ett element nu, om denna funktion existerat.

# notifications.content-locked
source: The content is currently locked, do you still want to save?
ca: El contingut està actualment bloquejat, Vols guardar?
es: El contenido está actualmente bloqueado, ¿Quiere guardarlo?
fr: Le contenu est actuellement verrouillé, voulez vous enregistrer malgré tout?
it: Il contenuto è attualmente bloccato, vuoi ancora salvare?
no: Innholdet er låst, vil du fortsatt lagre?
sv: Innehållet är låst, vill du fortfarande spara?

# notifications.change_site_root
source: You are going to switch to another site. Are you sure ?
ca: Vas a canviar a un altre lloc. Estàs segur?
es: Va a cambiar a otro sitio. ¿Está seguro?
fr: Vous allez changer de site web. Êtes-vous sûr(e) ?
it: Stai per passare ad un altro sito. Sei sicuro?
no: Du kommer til å bytte til et annet nettsted. Er du sikker?
sv: Du kommer att byta till en annan webbplats. Är du säker?

# notifications.save-pages-title
source: Page saved
ca: Pàgina guardada
es: Página guardada
fr: Page enregistrée
it: Pagina salvata
no: Siden er lagret
sv: Sidan sparad

# notifications.update.content.success
source: Content updated (%s)
ca: Contingut actualitzat (%s)
es: Contenido actualizado (%s)
fr: Contenu mis à jour (%s)
it: Contenuto aggiornato (%s)
no: Innhold oppdatert (%s)
sv: Innehåll uppdaterat (%s)

# notifications.update.pages.success
source: Page title updated (%s)
ca: Títol de la pàgina actualitzat (%s)
es: Título de página actualizado (%s)
fr: Titre de la page mis à jour (%s)
it: Titolo della pagina aggiornato (%s)
no: Sidetittel oppdatert (%s)
sv: Sidtitel uppdaterad (%s)

# notifications.update.content.fail
source: Content could not be updated (%s)
ca: El contingut ha pogut ser actualitzat (%s)
es: No se ha podido actualizar el contenido (%s)
fr: Le contenu n'a pas pu être mis à jour (%s)
it: Il contenuto non può essere aggiornato (%s)
no: Innholdet kunne ikke oppdateres (%s)
sv: Innehållet kunde inte uppdateras (%s)

# notifications.update.pages.fail
source: Page could not be updated (%s)
ca: La pàgina no ha pogut ser actualitzada (%s)
es: No se ha podido actualizar la página (%s)
fr: La page n'a pas pu être mise à jour (%s)
it: La pagina non può essere aggiornata (%s)
no: Siden kunne ikke oppdateres (%s)
sv: Sidan kunde inte uppdateras (%s)

# notifications.new.content.success
source: The content element was created
ca: S'ha creat l'element de contingut
es: El elemento de contenido ha sido creado
fr: L'élément de contenu a été créé avec succès
it: È stato creato un nuovo elemento
no: Innholdselementet ble opprettet
sv: Innehållselementet har skapats

# notifications.new.content.fail
source: The content element could not be created
ca: No s'ha pogut crear l'element de contingut
es: No se ha podido crear el elemento de contenido
fr: Le contenu n'a pas pu être créé
it: L'elemento non può essere creato
no: Innholdselementet kunne ikke opprettes
sv: Innehållsdelen kunde inte skapas

# notifications.request.configuration.fail
source: Could not fetch editor configurations due to a request error. ({0}, "{1}")
ca: No s'han pogut obtenir les configuracions de l'editor a causa d'un error de sol·licitud. ({0}, "{1}")
es: No se han podido obtener las configuraciones del editor debido a un error de solicitud. ({0}, "{1}")
fr: Impossible d'accéder à la configuration de l'éditeur à cause d'une erreur lors de la requête: ({0}, "{1}")
it: Impossibile recuperare le configurazioni dell'editor a causa di un errore di richiesta. ({0}, "{1}")
no: Kunne ikke hente tekstbehandlerkonfigurasjoner på grunn av en forespørselsfeil. ({0}, "{1}")
sv: Kunde inte hämta editorkonfigurationer på grund av ett förfrågningsfel. ({0},{1}")

# placeholder.label-wrap
source: Enter %s here
ca: Introdueix %s açí
es: Ingrese %s aquí
fr: Entrer %s ici
it: Inserisci %s qui
no: Skriv %s her
sv: Ange %s här

# placeholder.default-label
source: Enter text here
ca: Introdueix el text açí
es: Introduzca texto aquí
fr: Entrer votre texte ici
it: Inserisci il testo qui
no: Skriv tekst her
sv: Ange text här

# right-bar.element-title
source: Drag and drop on page to create a new '%s' content element.
ca: Arrastra y solta a la pàgina per crear un nou '%s' element de contingut.
es: Arrastre y suelte en la página para crear un nuevo elemento de contenido '%s'.
fr: Glisser-déposer sur la page pour créer un nouvel élément de contenu '%s'.
it: Trascina e rilascia sulla pagina per creare un nuovo elemento '%s'.
no: Trekk og slipp på siden for å opprette et nytt '%s'-innholdselement.
sv: Dra och släpp på sidan för att skapa ett nytt '%s' innehållselement.

# right-bar.on-page.changed
source: Modified:
fr: Modifié:
sv: Ändrad:

# right-bar.on-page.title
source: Elements on page
fr: Éléments sur la page
sv: Element på sidan

# right-bar.custom-record.title
source: Custom records
ca: Registres personalitzats
es: Registros personalizados
fr: Enregistrements personnalisés
it: Elementi personalizzati
no: Egendefinerte
sv: Anpassade element

# noValidPageSelected
source: Please select a page with a valid page type in the page tree on the left to preview the selected page.
ca: Selecciona una pàgina amb un tipus de pàgina vàlid a l'arbre de pàgines de l'esquerra per previsualitzar la pàgina seleccionada.
es: Por favor, seleccione una página con un tipo de página válido en el árbol de páginas de la izquierda para previsualizar la página seleccionada.
fr: Sélectionnez une page avec un type de page valide dans l'arborescence des sites située à gauche afin d'en obtenir un aperçu.
it: Seleziona una pagina di tipo valido dall'Albero delle Pagine a sinistra per visualizzare in anteprima la pagina selezionata.
no: Vennligst velg en side med en gyldig sidetype i sidetreet til venstre for å forhåndsvise den valgte siden.
sv: Välj en sida med en giltig sidtyp i sidträdet till vänster för att förhandsgranska den valda sidan.

# noSiteConfiguration
source: The requested page is missing a valid site configuration.
ca: Falta configuració vàlida a la pàgina sol·licitada.
es: La página solicitada require una configuración válida del sitio.
fr: Le site contenant la page demandée n'est pas correctement configuré.
it: Alla pagina manca una valida configurazione del sito.
no: Den forespurte siden mangler en gyldig nettstedskonfigurasjon.
sv: Den begärda sidan saknar en giltig webbplatskonfiguration.

source: Maximized
ca: Maximitzat
es: Maximizado
fr: Agrandi
it: Massimizzato
no: Maksimert
sv: Maximera

source: Custom
ca: Personalitzar
es: Personalizado
fr: Personnalisé
it: Personalizzato
no: Egendefinert
sv: Anpassad

source: Refresh page
ca: Refrescar pàgina
es: Actualizar página
fr: Rafraîchir la page
it: Aggiorna pagina
no: Last inn siden på nytt
sv: Uppdatera sidan

source: Yes
ca: Sí
es: Sí
fr: Oui
it: Sì
no: Ja
sv: Ja

source: No
fr: Non
no: Nei
sv: Nej

# otherDomain
source: To edit the current page, you need to log in to
it: Per modificare la pagina corrente, è necessario accedere
